Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: You will also need to configure a token age property for the logout token verification to succeed if your OIDC provider does not set an expiry claim in the current logout token. For example, set `quarkus.oidc.token.age=10S` to ensure that no more than 10 seconds elapse since the logout token's `iat` (issued at) time.
ja_jp: OIDC プロバイダーが、現在のログアウトトークンに有効期限を設定していない場合、ログアウトトークンの検証が成功するようにトークンの有効期間プロパティーを設定する必要もあります。 たとえば、ログアウトトークンの `iat` (発行時刻) から 10 秒超過しないようにするには、 `quarkus.oidc.token.age=10S` を設定します。

source: You will also need to configure the `maven-compiler-plugin` of the deployment module to detect the `quarkus-extension-processor` annotation processor.
ja_jp: また、 `quarkus-extension-processor` アノテーションプロセッサを検出するようデプロイメントモジュールの `maven-compiler-plugin` を設定する必要があります。

source: You will also need to provide a username and password, since authentication is always required on Astra clusters.
ja_jp: Astra クラスターでは常に認証が必要なため、ユーザー名とパスワードも指定する必要があります。

source: You will also see in the Dev UI console something similar to:
ja_jp: また、Dev UI コンソールには以下のように表示されます。

source: You will also see the lastest Quarkus Insights episodes, top tweets and upcoming Quarkus attended events.
ja_jp: また、最新のQuarkus Insightsエピソード、トップツイート、Quarkusが参加する今後のイベントも載っています。

source: You will also see the latest Quarkus Insights episodes, top tweets/discussions and upcoming Quarkus attended events.
ja_jp: 最新のQuarkus Insightsエピソード、トップツイート/ディスカッション、今後開催されるQuarkus参加イベントもご覧いただけます。

source: You will be allowed to use the following annotations to customize this mapping:
ja_jp: このマッピングをカスタマイズするために、以下のアノテーションを使用することができます。

source: You will be asked to log in into a `Single Page Application` provided by `OpenID Connect Dev UI`:
ja_jp: `OpenID Connect Dev UI` が提供する `Single Page Application` へのログインを求められます。

source: You will be asked to login into a `Single Page Application` provided by `OpenID Connect Dev UI`:
ja_jp: `OpenID Connect Dev UI` が提供する `シングルページアプリケーション` にログインするように求められます。

source: You will be redirected to Auth0 and prompted to log in:
ja_jp: Auth0 にリダイレクトされ、ログインするように求められます。

source: You will be redirected to Auth0 to log in. You will then be redirected to the OIDC Dev UI dashboard, as follows:
ja_jp: ログインのために Auth0 にリダイレクトされます。 その後、次のように、OIDC Dev UI ダッシュボードにリダイレクトされます。

source: You will build a REST application that optimizes a school timetable for students and teachers:
ja_jp: 生徒と教師の時間割を最適化する REST アプリケーションを作成します。

source: You will find all the details about this new feature in the link:/guides/datasource#devservices-configuration-free-databases[Datasource guide].
ja_jp: この新機能の詳細は、 link:/guides/datasource#devservices-configuration-free-databases[データソースガイド]に記載されています。

source: You will find at the top a line looking like this:
ja_jp: 一番上にこのような行があります。

source: You will find mention in https://access.redhat.com/security/cve/cve-2021-44228[Red Hat’s product security bulletin] that “Red Hat Integration Camel Extensions for Quarkus” is affected. It gets classified this way because during Red Hat’s productized build the log4j-core.jar got included in the generated Maven repository zip file due to the transitive nature of Maven dependencies. Meaning that if you use Camel Quarkus you are not affected by the log4j vulnerability but Red Hat product technically “shipped” the log4j-core.jar thus it is marked as affected.
ja_jp: link:https://access.redhat.com/security/cve/cve-2021-44228[Red Hatの製品セキュリティ情報] には、"Red]Hat Integration Camel Extensions for Quarkus" が影響を受けると記載されています。これは、Red Hatの製品化されたビルド中に、Maven依存関係の推移的な性質により、生成されたMavenリポジトリのZIPファイルにlog4j-core.jarが含まれたため、このように分類されています。つまり、Camel Quarkusを使用している場合は、log4jの脆弱性の影響を受けませんが、Red Hat製品は技術的にlog4j-core.jarを「出荷」しているので、影響を受けるとマークされています。

source: You will have a big warning when doing so and we still encourage you to create issues about the properties you would like to see added and fully supported as that will impact future developments of Hibernate ORM and the Hibernate ORM extension in Quarkus.
ja_jp: この場合、大きな警告が表示されます。また、Hibernate ORMおよびQuarkusのHibernate ORMエクステンションの今後の開発に影響を与えるため、追加して完全にサポートするプロパティに関するIssueを作成することをお勧めします。

source: You will have access to the same functionalities of the _imperative_ variant inside the reactive one: bson annotations, custom ID, PanacheQL, ... But the methods on your entities or repositories will all return reactive types.
ja_jp: bsonアノテーション、カスタムID、PanacheQLなど、 リアクティブ バリアント内で _命令型_ のバリアントと同じ機能を利用できますが、エンティティやリポジトリのメソッドはすべてリアクティブ型を返します。

source: You will have to add the `@Blocking` annotation on your `WebAuthnUserProvider` class in order to tell the Quarkus WebAuthn endpoints to defer those calls to the worker pool.
ja_jp: Quarkus WebAuthnエンドポイントに、これらの呼び出しをワーカープールに委ねるように指示するために、 `@Blocking` アノテーションを `WebAuthnUserProvider` クラスに追加する必要があります。

source: You will have to add the `@Blocking` annotation on your link:{webauthn-api}/io/quarkus/security/webauthn/WebAuthnUserProvider.html[`WebAuthnUserProvider`] class in order for the Quarkus WebAuthn endpoints to defer those calls to the worker pool.
ja_jp: Quarkus WebAuthn エンドポイントがその呼び出しをワーカープールに委任するには、link:{webauthn-api}/io/quarkus/security/webauthn/WebAuthnUserProvider.html[`WebAuthnUserProvider`] クラス に `@Blocking` アノテーションを追加する必要があります。

source: You will have to add the `@RunOnVirtualThread` annotation on your link:{webauthn-api}/io/quarkus/security/webauthn/WebAuthnUserProvider.html[`WebAuthnUserProvider`] class in order to tell the Quarkus WebAuthn endpoints to defer those calls to the worker pool.
ja_jp: Quarkus WebAuthn エンドポイントがその呼び出しをワーカープールに委任するには、link:{webauthn-api}/io/quarkus/security/webauthn/WebAuthnUserProvider.html[`WebAuthnUserProvider`] クラス に `@RunOnVirtualThread` アノテーションを追加する必要があります。

source: You will most likely need to configure your OpenId Connect provider to support redirecting back to the `Dev Console`. Add `http://localhost:8080/q/dev-v1/io.quarkus.quarkus-oidc/provider` as one of the supported redirect and logout URLs. one of the supported redirect and logout URLs.
ja_jp: OpenID Connect プロバイダーが `Dev Console` へ、リダイレクトで戻すことをサポートするように設定する必要がある場合がほとんどでしょう。 `http://localhost:8080/q/dev-v1/io.quarkus.quarkus-oidc/provider` を、サポートされているリダイレクトおよびログアウトURLの1つにしてください。

source: You will most likely need to configure your OpenId Connect provider to support redirecting back to the `Dev Console`. Add `http://localhost:8080/q/dev/io.quarkus.quarkus-oidc/provider` as one of the supported redirect and logout URLs.
ja_jp: OpenId Connect プロバイダーが `Dev Console` へのリダイレクトをサポートするように設定する必要があるようです。 `http://localhost:8080/q/dev/io.quarkus.quarkus-oidc/provider` をリダイレクトとログアウトの URL として追加してください。

source: You will need to add the following dependency to your project:
ja_jp: プロジェクトに次の依存関係を追加する必要があります。

source: You will need to apply the `io.quarkus.extension` plugin in the `runtime` module of your extension project. The plugin includes the `extensionDescriptor` task that will generate `META-INF/quarkus-extension.properties` and `META-INF/quarkus-extension.yml` files. The plugin also enables the `io.quarkus:quarkus-extension-processor` annotation processor in both `deployment` and `runtime` modules to collect and generate the rest of the xref:extension-metadata.adoc[Quarkus extension metadata]. The name of the deployment module can be configured in the plugin by setting the `deploymentModule` property. The property is set to `deployment` by default:
ja_jp: エクステンションプロジェクトの `runtime` モジュールに `io.quarkus.extension` プラグインを適用する必要があります。 このプラグインには `META-INF/quarkus-extension.properties` と `META-INF/quarkus-extension.yml` ファイルを生成する `extensionDescriptor` というタスクが含まれています。 また、このプラグインは `io.quarkus:quarkus-extension-processor` アノテーションプロセッサを `deployment` と `runtime` の両方のモジュールで有効にして、残りの xref:extension-metadata.adoc[Quarkus extension metadata] を収集し生成するようにします。 デプロイメントモジュールの名前は、プラグイン内で `deploymentModule` プロパティを設定することによって設定することができます。このプロパティは、デフォルトで `deployment` に設定されています。

source: You will need to apply the `io.quarkus.extension` plugin in the `runtime` module of your extension project. The plugin includes the `extensionDescriptor` task that will generate `META-INF/quarkus-extension.properties` and `META-INF/quarkus-extension.yml` files. The plugin also enables the `io.quarkus:quarkus-extension-processor` annotation processor in both `deployment` and `runtime` modules. The name of the deployment module can be configured in the plugin by setting the `deploymentArtifact` property. The property is set to `deployment` by default:
ja_jp: エクステンションプロジェクトの `runtime` モジュールに `io.quarkus.extension` プラグインを適用する必要があります。このプラグインには、 `META-INF/quarkus-extension.properties` と `META-INF/quarkus-extension.yml` のファイルを生成する `extensionDescriptor` タスクが含まれています。また、このプラグインは `deployment` と `runtime` の両方のモジュールで `io.quarkus:quarkus-extension-processor` アノテーションプロセッサを有効にします。デプロイメントモジュールの名前は、プラグインで `deploymentArtifact` プロパティを設定することで設定できます。このプロパティは、デフォルトでは `deployment` に設定されています。

source: You will need to implement an `AnnotationsTransformer` and strip out out the problematic injection sites. (Remember, if the use case involves CDI, it needs to be an `AnnotationsTransformer`, not a BytecodeTransformer`.) See link:https://quarkus.io/blog/solving-problems-with-extensions-2/[this blog] about on using an `AnnotationsTransformer` extension to clean non `@Inject` annotations from the Airline library so that it can be used in CDI-enabled runtimes.
ja_jp: `AnnotationsTransformer` を実装し、問題のある注入サイトを取り除く必要があります。(ユースケースに CDI が含まれる場合は、BytecodeTransformer ではなく `AnnotationsTransformer` にする必要があることに注意してください。) `AnnotationsTransformer` エクステンションを使用して Airline ライブラリーから `@Inject` 以外のアノテーションをクリーンアップし、CDI 対応ランタイムで使用できるようにする方法は、link:https://quarkus.io/blog/solving-problems-with-extensions-2/[このブログ] を参照してください。

source: You will need to include the `io.quarkus:quarkus-bootstrap-maven-plugin` to generate the Quarkus extension descriptor included into the runtime artifact, if you are using the Quarkus parent pom it will automatically inherit the correct configuration. Furthermore, you'll need to configure the `maven-compiler-plugin` to detect the `quarkus-extension-processor` annotation processor.
ja_jp: ランタイムアーティファクトに含まれるQuarkusエクステンション記述子を生成するために、 `io.quarkus:quarkus-bootstrap-maven-plugin` をインクルードする必要があります。さらに、 `quarkus-extension-processor` アノテーションプロセッサを検出するために、 `maven-compiler-plugin` を設定する必要があります。

source: You will need to include the `io.quarkus:quarkus-extension-maven-plugin` and configure the `maven-compiler-plugin` to detect the `quarkus-extension-processor` annotation processor to collect and generate the necessary xref:extension-metadata.adoc[Quarkus extension metadata] for the extension artifacts, if you are using the Quarkus parent pom it will automatically inherit the correct configuration.
ja_jp: `io.quarkus:quarkus-extension-maven-plugin` をインクルードして、 `maven-compiler-plugin` で `quarkus-extension-processor` アノテーションプロセッサを検出し、拡張アーティファクトに必要な xref:extension-metadata.adoc[Quarkus エクステンションメタデータ]を収集・生成する必要がありますが、もし Quarkus 親 pom を使用していれば自動的に正しい構成を継承します。

source: You will notice that some properties contain "jdbc" in their name: this is because Hibernate ORM refers to its "data access" layer as "JDBC" for historical reasons. Hibernate Reactive uses Vert.x Reactive SQL clients for its data access layer rather than JDBC.
ja_jp: 一部のプロパティーの名前に「jdbc」が含まれていることに気づくでしょう。これは、Hibernate ORM が歴史的な理由からその「データアクセス」層を「JDBC」と呼んでいるためです。Hibernate Reactive は、そのデータアクセス層に JDBC ではなく Vert.x Reactive SQL クライアントを使用します。

source: You will now be in a shell within the Kubernetes cluster. Within the shell, execute this curl command , the broker address is an example and might differ based on your project or broker name.
ja_jp: これで、Kubernetesクラスタ内のシェルに入ります。シェル内で次のcurlコマンドを実行します。ブローカーのアドレスは一例であり、プロジェクトやブローカー名によって異なる場合があります。

source: You will now start it with:
ja_jp: これからは以下で起動します:

source: You will receive a response such as:
ja_jp: このような回答が返ってきます:

source: You will see a log entry like this:
ja_jp: 次のようなログエントリーが表示されます。

source: You will see a screen like this one:
ja_jp: 次のような画面が表示されます。

source: You will see an *Infinispan Client* box. Click on *Web Console* and enter the credentials above.
ja_jp: *Infinispan Client* のボックスが表示されます。 *Web Console* をクリックし、上記のクレデンシャルを入力します。

source: You will see in the console something similar to:
ja_jp: コンソールには以下のように表示されます。

source: You will see the generated OpenAPI schema document:
ja_jp: 生成されたOpenAPIスキーマのドキュメントが表示されます:

source: You will see us do updates in Quarkus and Quarkus extensions to reduce these false positives. As a user and consumer of Quarkus, your application is not exposed to the log4j vulnerability.
ja_jp: QuarkusおよびQuarkusエクステンションでは、このような誤検出を減らすためのアップデートが行われていることが確認出来ます。Quarkusのユーザーおよび消費者として、アプリケーションはlog4jの脆弱性にさらされることはありません。

source: You will still register your routes, but using a managed `Router`:
ja_jp: ルートの登録は引き続き行いますが、管理されている `Router` を使用します:

source: You will then be logged in, and can check that the user API is now accessible:
ja_jp: その後、ログインし、ユーザーAPIにアクセスできるようになったことを確認できます。

source: You will then need to specify your own provider to configure and initialize the MeterRegistry, as discussed in the next section.
ja_jp: 次に、次のセクションで説明するように、MeterRegistry を設定して初期化するために、独自のプロバイダを指定する必要があります。

source: You will usually specify the `db-kind` property or explicitly enable Dev Services by setting `quarkus.datasource."name".devservices.enabled=true`.
ja_jp: 通常、 `db-kind` プロパティを指定するか、 `quarkus.datasource."name".devservices.enabled=true` を設定して明示的に Dev Services を有効にします。

source: You work with Quarkus extensions that do not support `HTTP`, such as `Quarkus GRPC`.
ja_jp: `HTTP` をサポートしていないQuarkusエクステンション、例えば `Quarkus GRPC` などを使用している場合。

source: You'll be prompted for the required information such as server URL, password, etc.
ja_jp: サーバーのURLやパスワードなど、必要な情報の入力が求められます。

source: You'll need to https://docs.ansible.com/ansible/latest/installation_guide/intro_installation.html[install Ansible] on your workstation. Once this is done, you can install this extension for Ansible dedicated to Quarkus with the following command:
ja_jp: ワークステーションに link:https://docs.ansible.com/ansible/latest/installation_guide/intro_installation.html[Ansibleをインストール] する必要があります。これが完了したら、次のコマンドでQuarkus専用のAnsible用エクステンションをインストールできます：

source: You'll need to implement the _service interface_ or extend the _base class_ with your service implementation bean as described in the following sections.
ja_jp: 以下のセクションで説明するように、 _サービスインターフェース_ を実装するか、 _ベースクラス_ をサービス実装Beanで拡張する必要があります。

source: You'll need two different terminal windows. One to do a curl request to the Broker, the other to watch the pod log files so you can see the messages flowing through the Funqy function event chain.
ja_jp: 2つの異なるターミナルウィンドウが必要です。一つは Broker への curl リクエストを行うためのもので、もう一つはポッドのログファイルを見るためのもので、Funqy 関数のイベントチェーンを流れるメッセージを見ることができます。

source: You'll need two different terminal windows. One to do a curl request to the Broker, the other to watch the pod log files, so you can see the messages flowing through the Funqy function event chain.
ja_jp: 2つの異なるターミナルウィンドウが必要です。一つは Broker への curl リクエストを行うためのもので、もう一つはポッドのログファイルを見るためのもので、Funqy 関数のイベントチェーンを流れるメッセージを見ることができます。

source: You'll see that Alice and Bob are always included in the list of names.
ja_jp: Alice と Bob が常に名前のリストに含まれていることがわかります。

source: You've probably heard of the _inversion of control_ (IoC) programming principle. Dependency injection is one of the implementation techniques of IoC.
ja_jp: _制御の反転_ (Inversion of Control, IoC )というプログラミングの原理を聞いたことがあると思います。依存性注入はIoCの実装技術の一つです。

source: You've taken a simple REST application and updated it to write and read data from a database, using Hibernate ORM and Panache. The data was persisted to a 'real' database, without you having to configure anything.
ja_jp: シンプルな REST アプリケーションを取得し、Hibernate ORM と Panache を使用して、 データベースへのデータの読み書きを行うように更新しました。データは「実際の」データベースに永続化されましたが、 特に設定を行う必要はありませんでした。

source: Your Auth0 application gets created with a client ID, secret, and HTTPS-based domain. Make a note of these properties because you will need them to complete the Quarkus configuration in the next step.
ja_jp: Auth0 アプリケーションは、クライアント ID、シークレット、 https ベースのドメインを使用して作成されます。 次の手順で Quarkus 設定を完了するために必要となるため、これらのプロパティーをメモしておいてください。

source: Your Dockerfiles will also need to be adjusted to take this into account.
ja_jp: また、Dockerfilesもこれを考慮して調整する必要があります。

source: Your JAX-RS endpoint may accept not only HTTP POST requests with `application/x-www-form-urlencoded` or `multipart/form-data` payloads but also payloads with other media types, either on the same or different URL paths, and therefore you would like to avoid verifying the CSRF token in such cases, for example:
ja_jp: JAX-RS のエンドポイントは、 `application/x-www-form-urlencoded` または `multipart/form-data` のペイロードを持つ HTTP POST リクエストだけでなく、他のメディアタイプを持つペイロードも、同じ URL パスまたは異なる URL パスで受け入れることがあります。したがって、そのような場合に CSRF トークンの検証を回避したいのです。例:

source: Your Jakarta REST endpoint may accept not only HTTP POST requests with `application/x-www-form-urlencoded` or `multipart/form-data` payloads but also payloads with other media types, either on the same or different URL paths, and therefore you would like to avoid verifying the CSRF token in such cases, for example:
ja_jp: Jakarta REST エンドポイントは、 `application/x-www-form-urlencoded` または `multipart/form-data` のペイロードを持つ HTTP POST リクエストだけでなく、他のメディアタイプを持つペイロードも、同じ URL パスまたは異なる URL パスで受け入れることがあります。したがって、そのような場合は CSRF トークンの検証を回避したいでしょう。例:

source: Your Java runtime supports virtual threads.
ja_jp: Javaランタイムが仮想スレッドをサポートしていること。

source: Your OIDC-secured application integrates into an environment where it can be called from single-page applications. Therefore, it needs to work with major OIDC providers, run behind an HTTP reverse proxy, support external and internal access, and so on.
ja_jp: OIDC によって保護されたアプリケーションは、シングルページアプリケーションから呼び出すことができる環境に統合されます。 これは、主要な OIDC プロバイダーと連携し、HTTP リバースプロキシーの背後で実行され、外部および内部アクセスをサポートするなど、さまざまな要件を満たす必要があります。

source: Your Quarkus HTTPS application must use a _build-time_ property to enable a Let's Encrypt ACME challenge route:
ja_jp: Quarkus HTTPS アプリケーションでは、_build-time_ プロパティーを使用して Let's Encrypt ACME チャレンジルートを有効にする必要があります。

source: Your Quarkus application includes the `quarkus-keycloak-authorization` extension.
ja_jp: Quarkus アプリケーションに `quarkus-keycloak-authorization` エクステンションが含まれている。

source: Your Quarkus project includes pregenerated Dockerfiles with instructions. If you want to use a custom Dockerfile, add the file to the `src/main/docker` directory or any location inside the module. Additionally, if you want to have multiple Docker files and switch between them, set the path to your preferred Dockerfile by using the `quarkus.openshift.native-dockerfile` property.
ja_jp: Quarkus プロジェクトには、手順が記載された事前に生成された Dockerfile が含まれています。カスタム Dockerfile を使用したい場合、ファイルを `src/main/docker` ディレクトリまたはモジュール内の任意の場所に追加します。さらに、複数の Docker ファイルがあり、それらを切り替えたい場合は、`quarkus.openshift.native-dockerfile` プロパティーを使用して、使用する Dockerfile へのパスを設定します。

source: Your REST method then looks like this:
ja_jp: REST メソッドは次のようになります。

source: Your `application.properties` would then look like this:
ja_jp: `application.properties` は次のようになります。

source: Your `pom.xml` dependencies as well as your Java code would be identical to the precedent example. The only difference is that you would specify your Hibernate ORM configuration in `META-INF/persistence.xml`:
ja_jp: `pom.xml` の依存関係と Java コードは先の例と同じになります。唯一の違いは `META-INF/persistence.xml` で Hibernate ORM の設定を行うことだけです:

source: Your `proto` file must not contain `option java_generic_services = true;`. https://developers.google.com/protocol-buffers/docs/reference/java-generated?hl=en#service[Generic services are deprecated] and are not compatible with Quarkus code generation plugins.
ja_jp: `proto` ファイルには、 `option java_generic_services = true;` を含めてはいけません。 link:https://developers.google.com/protocol-buffers/docs/reference/java-generated?hl=en#service[汎用サービスは非推奨] であり、Quarkusのコード生成プラグインと互換性がありません。

source: Your application can get the launch mode by injecting the `io.quarkus.runtime.LaunchMode` enum into a CDI bean, or by invoking the static method `io.quarkus.runtime.LaunchMode.current()`.
ja_jp: アプリケーションは、 `io.quarkus.runtime.LaunchMode` enum を CDI Beanに注入するか、静的メソッド `io.quarkus.runtime.LaunchMode.current()` を呼び出すことで起動モードを取得できます。

source: Your application does not need to switch to the Reactive SQL client if it already uses Hibernate ORM with one of the JDBC driver extensions.
ja_jp: アプリケーションがすでにいずれかの JDBC ドライバーエクステンションを備えた Hibernate ORM を使用している場合は、Reactive SQL クライアントを使用するように切り替える必要はありません。

source: Your application is not required to switch to using the Reactive SQL client if it already uses Hibernate ORM with one of the JDBC driver extensions.
ja_jp: アプリケーションがすでにいずれかの JDBC ドライバーエクステンションを備えた Hibernate ORM を使用している場合は、Reactive SQL クライアントを使用するように切り替える必要はありません。

source: Your application may have additional requirements. For example, if you have an application that manipulates graphics, images, or PDFs, you likely have Quarkus AWT extension included in the project and your native executable will require some additional libraries to run. In this case, you need to use a multi-stage `dockerfile` to copy the required libraries.
ja_jp: お使いのアプリケーションに追加の要件がある場合があります。たとえば、グラフィック、画像、または PDF を操作するアプリケーションがある場合、プロジェクトに Quarkus AWT エクステンションが含まれており、ネイティブ実行可能ファイルの実行には追加のライブラリーが必要になる可能性があります。この場合、マルチステージの `dockerfile` を使用して、必要なライブラリーをコピーする必要があります。

source: Your application may have additional requirements. For example, if you have an application that requires `libfreetype.so`, you need to copy the native libraries to the container. In this case, you need to use a multi-stage `dockerfile` to copy the required libraries:
ja_jp: アプリケーションには追加の要件があるかもしれません。たとえば、 `libfreetype.so` を必要とするアプリケーションがある場合、ネイティブライブラリをコンテナにコピーする必要があります。この場合、必要なライブラリをコピーするために、多段式の `dockerfile` を使用する必要があります:

source: Your application performs actual work during startup, Leyden only optimizes class loading, not application logic.
ja_jp: アプリケーションは起動中に実際の作業を実行します。Leyden はクラスのロードのみを最適化し、アプリケーションロジックは最適化しません。

source: Your application secured by OIDC integrates in an environment where it can be called from single-page applications. It must work with well-known OIDC providers, run behind HTTP Reverse Proxy, require external and internal access, and so on.
ja_jp: OIDC によって保護されたアプリケーションは、シングルページアプリケーションから呼び出すことができる環境に統合されます。 これは、よく知られている OIDC プロバイダーと連携し、HTTP リバースプロキシーの背後で実行される必要があるほか、外部および内部アクセスなども必要とされます。

source: Your application should already be runnable via `heroku local web` from the repository root directory. You need to have run `mvn package` before to create the runnable jar for this to succeed.
ja_jp: アプリケーションは、リポジトリーの root ディレクトリーから `heroku local web` 経由ですでに実行可能である必要があります。これを成功させるには、事前に `mvn package` を実行して実行可能な JAR ファイルを作成しておく必要があります。

source: Your application should already be runnable via `heroku local web`.
ja_jp: あなたのアプリケーションは、すでに `heroku local web` を通して実行可能になっているはずです。

source: Your automation using the https://github.com/eirslett/frontend-maven-plugin[maven-frontend-plugin] or similar tools.
ja_jp: link:https://github.com/eirslett/frontend-maven-plugin[maven-frontend-plugin] または同様のツールを使用した自動化。

source: Your browser will ask you to activate your WebAuthn authenticator (you will need a WebAuthn-capable browser and possibly device, or you can use https://developer.chrome.com/docs/devtools/webauthn/[an emulator of those]):
ja_jp: ブラウザーが WebAuthn オーセンティケーターを有効化するよう求めてきます (WebAuthn 対応のブラウザーと、 場合によってはデバイスが必要です。または、 https://developer.chrome.com/docs/devtools/webauthn/[それらのエミュレーター] を使用することもできます）。

source: Your browser will ask you to activate your WebAuthn authenticator:
ja_jp: ブラウザがWebAuthn認証デバイスを有効にするよう要求します。
